In [2]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "C:/Users/choiy/Desktop/Pandas HW/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [3]:
#Shows first 5 rows
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [5]:
#Creates and stores an array that contains unique names with no duplicates
player_array = purchase_data['SN'].unique()
number_players = len(player_array)
number_players

576

In [6]:
#Number of unique items
number_of_items = purchase_data['Item Name'].unique()
unique_items = len(number_of_items)
unique_items

179

In [7]:
#Number of purchases
number_of_purchases = purchase_data['Purchase ID']
purchases = len(number_of_purchases)
purchases

780

In [8]:
mean_price = purchase_data['Price'].mean()
mean_price1 = round(mean_price,2)
mean_price1

3.05

In [9]:
purchasing_anaylsis = [unique_items,purchases,mean_price1]
purchasing_anaylsis

[179, 780, 3.05]

In [13]:
gender_df = purchase_data.groupby("Gender")
gender_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15